a='''
	 *        *
       *   *   *   *
     *       *       *
   *                   *
 *                      *
'''
b = ''''
                  *                     *
              *       *             *       *
          *               *      *              * 
      *                       *                     *
  *                                                     *
*                                                          *
'''
c = input('Введите высоту буквы М: ')
if c == '5':
    print(a)
elif c == '6':
    print(b)
